eclipse-threadx/getting-started/NXP/MIMXRT1050-EVKB/lib/MIMXRT1050-evk/src/components/codec/sgtl5000/fsl_sgtl5000.h
/*
 * SGTL5000_CHIP_SSS_CTRL
 */
#define SGTL5000_DAP_MIX_LRSWAP_CLR_MASK 0xBFFF
#define SGTL5000_DAP_MIX_LRSWAP_GET_MASK 0x4000
#define SGTL5000_DAP_MIX_LRSWAP_SHIFT    0xE
#define SGTL5000_DAP_LRSWAP_CLR_MASK     0xDFFF
#define SGTL5000_DAP_LRSWAP_GET_MASK     0x2000
#define SGTL5000_DAP_LRSWAP_SHIFT        0xD
#define SGTL5000_DAC_LRSWAP_CLR_MASK     0xEFFF
#define SGTL5000_DAC_LRSWAP_GET_MASK     0x1000
#define SGTL5000_DAC_LRSWAP_SHIFT        0xC
#define SGTL5000_I2S_LRSWAP_CLR_MASK     0xFBFF
#define SGTL5000_I2S_LRSWAP_GET_MASK     0x0400
#define SGTL5000_I2S_LRSWAP_SHIFT        0xA
#define SGTL5000_DAP_MIX_SEL_CLR_MASK    0xFCFF
#define SGTL5000_DAP_MIX_SEL_GET_MASK    0x0300
#define SGTL5000_DAP_MIX_SEL_SHIFT       0x8
#define SGTL5000_DAP_MIX_SEL_ADC         0x0000
#define SGTL5000_DAP_MIX_SEL_I2S_IN      0x0100
#define SGTL5000_DAP_SEL_CLR_MASK        0xFF3F
#define SGTL5000_DAP_SEL_GET_MASK        0x00C0
#define SGTL5000_DAP_SEL_SHIFT           0x6
#define SGTL5000_DAP_SEL_ADC             0x0000
#define SGTL5000_DAP_SEL_I2S_IN          0x0040
#define SGTL5000_DAC_SEL_CLR_MASK        0xFFCF
#define SGTL5000_DAC_SEL_GET_MASK        0x0030
#define SGTL5000_DAC_SEL_SHIFT           0x4
#define SGTL5000_DAC_SEL_ADC             0x0000
#define SGTL5000_DAC_SEL_I2S_IN          0x0010
#define SGTL5000_DAC_SEL_DAP             0x0030
#define SGTL5000_I2S_OUT_SEL_CLR_MASK    0xFFFC
#define SGTL5000_I2S_OUT_SEL_GET_MASK    0x0003
#define SGTL5000_I2S_OUT_SEL_SHIFT       0x0
#define SGTL5000_I2S_OUT_SEL_ADC         0x0000
#define SGTL5000_I2S_OUT_SEL_I2S_IN      0x0001
#define SGTL5000_I2S_OUT_SEL_DAP         0x0003

/*
 * SGTL5000_CHIP_ADCDAC_CTRL
 */
#define SGTL5000_VOL_BUSY_DAC_RIGHT         0x2000
#define SGTL5000_VOL_BUSY_DAC_LEFT          0x1000
#define SGTL5000_DAC_VOL_RAMP_EN_CLR_MASK   0xFDFF
#define SGTL5000_DAC_VOL_RAMP_EN_GET_MASK   0x0200
#define SGTL5000_DAC_VOL_RAMP_EN_SHIFT      0x9
#define SGTL5000_DAC_VOL_RAMP_EXPO_CLR_MASK 0xFEFF
#define SGTL5000_DAC_VOL_RAMP_EXPO_GET_MASK 0x0100
#define SGTL5000_DAC_VOL_RAMP_EXPO_SHIFT    0x8
#define SGTL5000_DAC_MUTE_RIGHT_CLR_MASK    0xFFF7
#define SGTL5000_DAC_MUTE_RIGHT_GET_MASK    0x0008
#define SGTL5000_DAC_MUTE_RIGHT_SHIFT       0x3
#define SGTL5000_DAC_MUTE_LEFT_CLR_MASK     0xFFFB
#define SGTL5000_DAC_MUTE_LEFT_GET_MASK     0x0004
#define SGTL5000_DAC_MUTE_LEFT_SHIFT        0x2
#define SGTL5000_ADC_HPF_FREEZE_CLR_MASK    0xFFFD
#define SGTL5000_ADC_HPF_FREEZE_GET_MASK    0x0002
#define SGTL5000_ADC_HPF_FREEZE_SHIFT       0x1
#define SGTL5000_ADC_HPF_BYPASS_CLR_MASK    0xFFFE
#define SGTL5000_ADC_HPF_BYPASS_GET_MASK    0x0001
#define SGTL5000_ADC_HPF_BYPASS_SHIFT       0x0

/*
 * SGTL5000_CHIP_DAC_VOL
 */
#define SGTL5000_DAC_VOL_RIGHT_CLR_MASK 0x00FF
#define SGTL5000_DAC_VOL_RIGHT_GET_MASK 0xFF00
#define SGTL5000_DAC_VOL_RIGHT_SHIFT    0x8
#define SGTL5000_DAC_VOL_LEFT_CLR_MASK  0xFF00
#define SGTL5000_DAC_VOL_LEFT_GET_MASK  0x00FF
#define SGTL5000_DAC_VOL_LEFT_SHIFT     0x0

/*
 * SGTL5000_CHIP_PAD_STRENGTH
 */
#define SGTL5000_PAD_I2S_LRCLK_CLR_MASK 0xFCFF
#define SGTL5000_PAD_I2S_LRCLK_GET_MASK 0x0300
#define SGTL5000_PAD_I2S_LRCLK_SHIFT    0x8
#define SGTL5000_PAD_I2S_SCLK_CLR_MASK  0xFF3F
#define SGTL5000_PAD_I2S_SCLK_GET_MASK  0x00C0
#define SGTL5000_PAD_I2S_SCLK_SHIFT     0x6
#define SGTL5000_PAD_I2S_DOUT_CLR_MASK  0xFFCF
#define SGTL5000_PAD_I2S_DOUT_GET_MASK  0x0030
#define SGTL5000_PAD_I2S_DOUT_SHIFT     0x4
#define SGTL5000_PAD_I2C_SDA_CLR_MASK   0xFFF3
#define SGTL5000_PAD_I2C_SDA_GET_MASK   0x000C
#define SGTL5000_PAD_I2C_SDA_SHIFT      0x2
#define SGTL5000_PAD_I2C_SCL_CLR_MASK   0xFFFC
#define SGTL5000_PAD_I2C_SCL_GET_MASK   0x0003
#define SGTL5000_PAD_I2C_SCL_SHIFT      0x0

/*
 * SGTL5000_CHIP_ANA_ADC_CTRL
 */
#define SGTL5000_ADC_VOL_M6DB_CLR_MASK  0xFEFF
#define SGTL5000_ADC_VOL_M6DB_GET_MASK  0x0100
#define SGTL5000_ADC_VOL_M6DB_SHIFT     0x8
#define SGTL5000_ADC_VOL_RIGHT_CLR_MASK 0xFF0F
#define SGTL5000_ADC_VOL_RIGHT_GET_MASK 0x00F0
#define SGTL5000_ADC_VOL_RIGHT_SHIFT    0x4
#define SGTL5000_ADC_VOL_LEFT_CLR_MASK  0xFFF0
#define SGTL5000_ADC_VOL_LEFT_GET_MASK  0x000F
#define SGTL5000_ADC_VOL_LEFT_SHIFT     0x0

/*
 * SGTL5000_CHIP_ANA_HP_CTRL
 */
#define SGTL5000_HP_VOL_RIGHT_CLR_MASK 0x80FF
#define SGTL5000_HP_VOL_RIGHT_GET_MASK 0x7F00
#define SGTL5000_HP_VOL_RIGHT_SHIFT    0x8
#define SGTL5000_HP_VOL_LEFT_CLR_MASK  0xFF80
#define SGTL5000_HP_VOL_LEFT_GET_MASK  0x007F
#define SGTL5000_HP_VOL_LEFT_SHIFT     0x0

/*
 * SGTL5000_CHIP_ANA_CTRL
 */
#define SGTL5000_MUTE_LO_GET_MASK    0x0100
#define SGTL5000_MUTE_LO_CLR_MASK    0xFEFF
#define SGTL5000_MUTE_LO_SHIFT       0x8
#define SGTL5000_SEL_HP_GET_MASK     0x0040
#define SGTL5000_SEL_HP_CLR_MASK     0xFFBF
#define SGTL5000_SEL_HP_SHIFT        0x6
#define SGTL5000_SEL_HP_DAC          0x0000
#define SGTL5000_SEL_HP_LINEIN       0x0040
#define SGTL5000_EN_ZCD_HP_GET_MASK  0x0020
#define SGTL5000_EN_ZCD_HP_CLR_MASK  0xFFDF
#define SGTL5000_EN_ZCD_HP_SHIFT     0x5
#define SGTL5000_MUTE_HP_GET_MASK    0x0010
#define SGTL5000_MUTE_HP_CLR_MASK    0xFFEF
#define SGTL5000_MUTE_HP_SHIFT       0x4
#define SGTL5000_SEL_ADC_GET_MASK    0x0004
#define SGTL5000_SEL_ADC_CLR_MASK    0xFFFB
#define SGTL5000_SEL_ADC_SHIFT       0x2
#define SGTL5000_SEL_ADC_MIC         0x0000
#define SGTL5000_SEL_ADC_LINEIN      0x0004
#define SGTL5000_EN_ZCD_ADC_GET_MASK 0x0002
#define SGTL5000_EN_ZCD_ADC_CLR_MASK 0xFFFD
#define SGTL5000_EN_ZCD_ADC_SHIFT    0x1
#define SGTL5000_MUTE_ADC_GET_MASK   0x0001
#define SGTL5000_MUTE_ADC_CLR_MASK   0xFFFE
#define SGTL5000_MUTE_ADC_SHIFT      0x0

/*
 * SGTL5000_CHIP_LINREG_CTRL
 */
#define SGTL5000_VDDC_MAN_ASSN_CLR_MASK 0xFFBF
#define SGTL5000_VDDC_MAN_ASSN_GET_MASK 0x0040
#define SGTL5000_VDDC_MAN_ASSN_SHIFT    0x6
#define SGTL5000_VDDC_MAN_ASSN_VDDA     0x0000
#define SGTL5000_VDDC_MAN_ASSN_VDDIO    0x0040
#define SGTL5000_VDDC_ASSN_OVRD         0x0020
#define SGTL5000_LINREG_VDDD_CLR_MASK   0xFFF0
#define SGTL5000_LINREG_VDDD_GET_MASK   0x000F
#define SGTL5000_LINREG_VDDD_SHIFT      0x0

