eclipse-threadx/getting-started/NXP/MIMXRT1050-EVKB/lib/MIMXRT1050-evk/src/components/codec/sgtl5000/fsl_sgtl5000.h
/*
 * SGTL5000_CHIP_REF_CTRL
 */
#define SGTL5000_ANA_GND_MASK    0x01f0
#define SGTL5000_ANA_GND_SHIFT   0x4
#define SGTL5000_ANA_GND_WIDTH   0x5
#define SGTL5000_ANA_GND_BASE    0x320 /* mv */
#define SGTL5000_ANA_GND_STP     0x19  /*mv */
#define SGTL5000_BIAS_CTRL_MASK  0x000e
#define SGTL5000_BIAS_CTRL_SHIFT 0x1
#define SGTL5000_BIAS_CTRL_WIDTH 0x3
#define SGTL5000_SMALL_POP       0x0001

/*
 * SGTL5000_CHIP_MIC_CTRL
 */
#define SGTL5000_BIAS_R__CLR_MASK   0xFCFF
#define SGTL5000_BIAS_R_GET_MASK    0x0300
#define SGTL5000_BIAS_R_SHIFT       0x8
#define SGTL5000_BIAS_R_off         0x0000
#define SGTL5000_BIAS_R_2K          0x0100
#define SGTL5000_BIAS_R_4k          0x0200
#define SGTL5000_BIAS_R_8k          0x0300
#define SGTL5000_BIAS_VOLT_CLR_MASK 0xFF8F
#define SGTL5000_BIAS_VOLT_GET_MASK 0x0070
#define SGTL5000_BIAS_VOLT_SHIFT    0x4
#define SGTL5000_MIC_GAIN_CLR_MASK  0xFFFC
#define SGTL5000_MIC_GAIN_GET_MASK  0x0003
#define SGTL5000_MIC_GAIN_SHIFT     0x0

/*
 * SGTL5000_CHIP_LINE_OUT_CTRL
 */
#define SGTL5000_LINE_OUT_CURRENT_CLR_MASK 0xF0FF
#define SGTL5000_LINE_OUT_CURRENT_GET_MASK 0x0F00
#define SGTL5000_LINE_OUT_CURRENT_SHIFT    0x8
#define SGTL5000_LINE_OUT_CURRENT_180u     0x0000
#define SGTL5000_LINE_OUT_CURRENT_270u     0x0100
#define SGTL5000_LINE_OUT_CURRENT_360u     0x0300
#define SGTL5000_LINE_OUT_CURRENT_450u     0x0700
#define SGTL5000_LINE_OUT_CURRENT_540u     0x0F00
#define SGTL5000_LINE_OUT_GND_CLR_MASK     0xFFC0
#define SGTL5000_LINE_OUT_GND_GET_MASK     0x003F
#define SGTL5000_LINE_OUT_GND_SHIFT        0x0
#define SGTL5000_LINE_OUT_GND_BASE         0x320 /* mv */
#define SGTL5000_LINE_OUT_GND_STP          0x19
#define SGTL5000_LINE_OUT_GND_MAX          0x23

/*
 * SGTL5000_CHIP_LINE_OUT_VOL
 */
#define SGTL5000_LINE_OUT_VOL_RIGHT_CLR_MASK 0xE0FF
#define SGTL5000_LINE_OUT_VOL_RIGHT_GET_MASK 0x1F00
#define SGTL5000_LINE_OUT_VOL_RIGHT_SHIFT    0x8
#define SGTL5000_LINE_OUT_VOL_LEFT_CLR_MASK  0xFFE0
#define SGTL5000_LINE_OUT_VOL_LEFT_GET_MASK  0x001F
#define SGTL5000_LINE_OUT_VOL_LEFT_SHIFT     0x0

/*
 * SGTL5000_CHIP_ANA_POWER
 */
#define SGTL5000_RIGHT_DAC_POWERUP_GET_MASK         0x4000
#define SGTL5000_RIGHT_DAC_POWERUP_CLR_MASK         0xBFFF
#define SGTL5000_RIGHT_DAC_POWERUP_SHIFT            0xE
#define SGTL5000_LINREG_SIMPLE_POWERUP_GET_MASK     0x2000
#define SGTL5000_LINREG_SIMPLE_POWERUP_CLR_MASK     0xDFFF
#define SGTL5000_LINREG_SIMPLE_POWERUP_SHIFT        0xD
#define SGTL5000_STARTUP_POWERUP_GET_MASK           0x1000
#define SGTL5000_STARTUP_POWERUP_CLR_MASK           0xEFFF
#define SGTL5000_STARTUP_POWERUP_SHIFT              0xC
#define SGTL5000_VDDC_CHRGPMP_POWERUP_GET_MASK      0x0800
#define SGTL5000_VDDC_CHRGPMP_POWERUP_CLR_MASK      0xF7FF
#define SGTL5000_VDDC_CHRGPMP_POWERUP_SHIFT         0xB
#define SGTL5000_PLL_POWERUP_GET_MASK               0x0400
#define SGTL5000_PLL_POWERUP_CLR_MASK               0xFBFF
#define SGTL5000_PLL_POWERUP_SHIFT                  0xA
#define SGTL5000_LINREG_D_POWERUP_GET_MASK          0x0200
#define SGTL5000_LINREG_D_POWERUP_CLR_MASK          0xFDFF
#define SGTL5000_LINREG_D_POWERUP_SHIFT             0x9
#define SGTL5000_VCOAMP_POWERUP_GET_MASK            0x0100
#define SGTL5000_VCOAMP_POWERUP_CLR_MASK            0xFEFF
#define SGTL5000_VCOAMP_POWERUP_SHIFT               0x8
#define SGTL5000_VAG_POWERUP_GET_MASK               0x0080
#define SGTL5000_VAG_POWERUP_CLR_MASK               0xFF7F
#define SGTL5000_VAG_POWERUP_SHIFT                  0x7
#define SGTL5000_RIGHT_ADC_POWERUP_GET_MASK         0x0040
#define SGTL5000_RIGHT_ADC_POWERUP_CLR_MASK         0xFFBF
#define SGTL5000_RIGHT_ADC_POWERUP_SHIFT            0x6
#define SGTL5000_REFTOP_POWERUP_GET_MASK            0x0020
#define SGTL5000_REFTOP_POWERUP_CLR_MASK            0xFFDF
#define SGTL5000_REFTOP_POWERUP_SHIFT               0x5
#define SGTL5000_HEADPHONE_POWERUP_GET_MASK         0x0010
#define SGTL5000_HEADPHONE_POWERUP_CLR_MASK         0xFFEF
#define SGTL5000_HEADPHONE_POWERUP_SHIFT            0x4
#define SGTL5000_DAC_POWERUP_GET_MASK               0x0008
#define SGTL5000_DAC_POWERUP_CLR_MASK               0xFFF7
#define SGTL5000_DAC_POWERUP_SHIFT                  0x3
#define SGTL5000_CAPLESS_HEADPHONE_POWERUP_GET_MASK 0x0004
#define SGTL5000_CAPLESS_HEADPHONE_POWERUP_CLR_MASK 0xFFFB
#define SGTL5000_CAPLESS_HEADPHONE_POWERUP_SHIFT    0x2
#define SGTL5000_ADC_POWERUP_GET_MASK               0x0002
#define SGTL5000_ADC_POWERUP_CLR_MASK               0xFFFD
#define SGTL5000_ADC_POWERUP_SHIFT                  0x1
#define SGTL5000_LINEOUT_POWERUP_GET_MASK           0x0001
#define SGTL5000_LINEOUT_POWERUP_CLR_MASK           0xFFFE
#define SGTL5000_LINEOUT_POWERUP_SHIFT              0x0

/*
 * SGTL5000_CHIP_PLL_CTRL
 */
#define SGTL5000_PLL_INT_DIV_CLR_MASK  0x07FF
#define SGTL5000_PLL_INT_DIV_GET_MASK  0xF800
#define SGTL5000_PLL_INT_DIV_SHIFT     0xB
#define SGTL5000_PLL_FRAC_DIV_CLR_MASK 0xF8FF
#define SGTL5000_PLL_FRAC_DIV_GET_MASK 0x0700
#define SGTL5000_PLL_FRAC_DIV_SHIFT    0x0

/*
 * SGTL5000_CHIP_CLK_TOP_CTRL
 */
#define SGTL5000_ENABLE_INT_OSC_GET_MASK  0x0800
#define SGTL5000_ENABLE_INT_OSC_CLR_MASK  0xF7FF
#define SGTL5000_ENABLE_INT_OSC_SHIFT     0xB
#define SGTL5000_INPUT_FREQ_DIV2_GET_MASK 0x0008
#define SGTL5000_INPUT_FREQ_DIV2_CLR_MASK 0xFFF7
#define SGTL5000_INPUT_FREQ_DIV2_SHIFT    0x3

/*
 * SGTL5000_CHIP_ANA_STATUS
 */
#define SGTL5000_HP_LRSHORT    0x0200
#define SGTL5000_CAPLESS_SHORT 0x0100
#define SGTL5000_PLL_LOCKED    0x0010

/*
 * SGTL5000_CHIP_SHORT_CTRL
 */
#define SGTL5000_LVLADJR_CLR_MASK      0x8FFF
#define SGTL5000_LVLADJR_GET_MASK      0x7000
#define SGTL5000_LVLADJR_SHIFT         0xC
#define SGTL5000_LVLADJL_CLR_MASK      0xF8FF
#define SGTL5000_LVLADJL_GET_MASK      0x0700
#define SGTL5000_LVLADJL_SHIFT         0x8
#define SGTL5000_LVLADJC_CLR_MASK      0xFF8F
#define SGTL5000_LVLADJC_GET_MASK      0x0070
#define SGTL5000_LVLADJC_SHIFT         0x4
#define SGTL5000_LR_SHORT_MOD_CLR_MASK 0xFFF3
#define SGTL5000_LR_SHORT_MOD_GET_MASK 0x000C
#define SGTL5000_LR_SHORT_MOD_SHIFT    0x2
#define SGTL5000_CM_SHORT_MOD_CLR_MASK 0xFFFC
#define SGTL5000_CM_SHORT_MOD_GET_MASK 0x0003
#define SGTL5000_CM_SHORT_MOD_SHIFT    0x0

/* DAP control register */
#define SGTL5000_DAP_CONTROL_MIX_EN_GET_MASK 0x0010
#define SGTL5000_DAP_CONTROL_MIX_EN_CLR_MASK 0xFFEF
#define SGTL5000_DAP_CONTROL_MIX_EN_SHIFT    0x4
#define SGTL5000_DAP_CONTROL_DAP_EN_GET_MASK 0x0001
#define SGTL5000_DAP_CONTROL_DAP_EN_CLR_MASK 0xFFFE
#define SGTL5000_DAP_CONTROL_DAP_EN_SHIFT    0x0

