eclipse-threadx/getting-started/NXP/MIMXRT1050-EVKB/lib/MIMXRT1050-evk/src/components/codec/sgtl5000/fsl_sgtl5000.h
/*
 * DAP_AUDIO_EQ_BASS_BAND0_REG
 */
#define SGTL5000_DAP_AUDIO_EQ_BASS_BAND0_VOLUME_GET_MASK 0x007F
#define SGTL5000_DAP_AUDIO_EQ_BASS_BAND0_VOLUME_CLR_MASK 0xFF80
#define SGTL5000_DAP_AUDIO_EQ_BASS_BAND0_VOLUME_SHIFT    0x0

/*
 * DAP_AUDIO_EQ_BAND1_REG
 */
#define SGTL5000_DAP_AUDIO_EQ_BAND1_VOLUME_GET_MASK 0x007F
#define SGTL5000_DAP_AUDIO_EQ_BAND1_VOLUME_CLR_MASK 0xFF80
#define SGTL5000_DAP_AUDIO_EQ_BAND1_VOLUME_SHIFT    0x0

/*
 * DAP_AUDIO_EQ_BAND2_REG
 */
#define SGTL5000_DAP_AUDIO_EQ_BAND2_VOLUME_GET_MASK 0x007F
#define SGTL5000_DAP_AUDIO_EQ_BAND2_VOLUME_CLR_MASK 0xFF80
#define SGTL5000_DAP_AUDIO_EQ_BAND2_VOLUME_SHIFT    0x0

/*
 * DAP_AUDIO_EQ_BAND3_REG
 */
#define SGTL5000_DAP_AUDIO_EQ_BAND3_VOLUME_GET_MASK 0x007F
#define SGTL5000_DAP_AUDIO_EQ_BAND3_VOLUME_CLR_MASK 0xFF80
#define SGTL5000_DAP_AUDIO_EQ_BAND3_VOLUME_SHIFT    0x0

/*
 * DAP_AUDIO_EQ_TREBLE_BAND4_REG
 */
#define SGTL5000_DAP_AUDIO_EQ_TREBLE_BAND4_VOLUME_GET_MASK 0x007F
#define SGTL5000_DAP_AUDIO_EQ_TREBLE_BAND4_VOLUME_CLR_MASK 0xFF80
#define SGTL5000_DAP_AUDIO_EQ_TREBLE_BAND4_VOLUME_SHIFT    0x0

/*
 * DAP_MAIN_CHAN_REG
 */
#define SGTL5000_DAP_MAIN_CHAN_VOL_GET_MASK 0xFFFF
#define SGTL5000_DAP_MAIN_CHAN_VOL_CLR_MASK 0x0000
#define SGTL5000_DAP_MAIN_CHAN_VOL_SHIFT    0x0

/*
 * DAP_MIX_CHAN_REG
 */
#define SGTL5000_DAP_MIX_CHAN_VOL_GET_MASK 0xFFFF
#define SGTL5000_DAP_MIX_CHAN_VOL_CLR_MASK 0x0000
#define SGTL5000_DAP_MIX_CHAN_VOL_SHIFT    0x0

/*
 * DAP_AVC_CTRL_REG
 */
#define SGTL5000_DAP_AVC_CTRL_APOP_ENABLE_GET_MASK   0x4000
#define SGTL5000_DAP_AVC_CTRL_APOP_ENABLE_CLR_MASK   0xBFFF
#define SGTL5000_DAP_AVC_CTRL_APOP_ENABLE_SHIFT      0xE
#define SGTL5000_DAP_AVC_CTRL_MAX_GAIN_GET_MASK      0x3000
#define SGTL5000_DAP_AVC_CTRL_MAX_GAIN_CLR_MASK      0xCFFF
#define SGTL5000_DAP_AVC_CTRL_MAX_GAIN_SHIFT         0xC
#define SGTL5000_DAP_AVC_CTRL_LBI_RESPONSE_GET_MASK  0x0300
#define SGTL5000_DAP_AVC_CTRL_LBI_RESPONSE_CLR_MASK  0xFCFF
#define SGTL5000_DAP_AVC_CTRL_LBI_RESPONSE_SHIFT     0x8
#define SGTL5000_DAP_AVC_CTRL_HARD_LIMIT_EN_GET_MASK 0x0020
#define SGTL5000_DAP_AVC_CTRL_HARD_LIMIT_EN_CLR_MASK 0xFFDF
#define SGTL5000_DAP_AVC_CTRL_HARD_LIMIT_EN_SHIFT    0x5
#define SGTL5000_DAP_AVC_CTRL_STOP_GET_MASK          0x0004
#define SGTL5000_DAP_AVC_CTRL_STOP_SHIFT             0x2
#define SGTL5000_DAP_AVC_CTRL_RUNNING_GET_MASK       0x0002
#define SGTL5000_DAP_AVC_CTRL_RUNNING_SHIFT          0x1
#define SGTL5000_DAP_AVC_CTRL_EN_GET_MASK            0x0001
#define SGTL5000_DAP_AVC_CTRL_EN_CLR_MASK            0xFFFE
#define SGTL5000_DAP_AVC_CTRL_EN_SHIFT               0x0

/*
 * DAP_AVC_ATTACK_REG
 */
#define SGTL5000_DAP_AVC_ATTACK_RATE_GET_MASK 0x0FFF
#define SGTL5000_DAP_AVC_ATTACK_RATE_CLR_MASK 0xF000
#define SGTL5000_DAP_AVC_ATTACK_RATE_SHIFT    0x0

/*
 * DAP_AVC_DECAY_REG
 */
#define SGTL5000_DAP_AVC_DECAY_RATE_GET_MASK 0x0FFF
#define SGTL5000_DAP_AVC_DECAY_RATE_CLR_MASK 0xF000
#define SGTL5000_DAP_AVC_DECAY_RATE_SHIFT    0x0

/*
 * DAP_COEF_WR_B1_LSB_REG
 */
#define SGTL5000_DAP_COEF_WR_B1_LSB_LSB_GET_MASK 0x000F
#define SGTL5000_DAP_COEF_WR_B1_LSB_LSB_CLR_MASK 0xFFF0
#define SGTL5000_DAP_COEF_WR_B1_LSB_LSB_SHIFT    0x0

/*
 * DAP_COEF_WR_B2_LSB_REG
 */
#define SGTL5000_DAP_COEF_WR_B2_LSB_LSB_GET_MASK 0x000F
#define SGTL5000_DAP_COEF_WR_B2_LSB_LSB_CLR_MASK 0xFFF0
#define SGTL5000_DAP_COEF_WR_B2_LSB_LSB_SHIFT    0x0

/*
 * DAP_COEF_WR_A1_LSB_REG
 */
#define SGTL5000_DAP_COEF_WR_A1_LSB_LSB_GET_MASK 0x000F
#define SGTL5000_DAP_COEF_WR_A1_LSB_LSB_CLR_MASK 0xFFF0
#define SGTL5000_DAP_COEF_WR_A1_LSB_LSB_SHIFT    0x0

/*
 * DAP_COEF_WR_A2_LSB_REG
 */
#define SGTL5000_DAP_COEF_WR_A2_LSB_LSB_GET_MASK 0x000F
#define SGTL5000_DAP_COEF_WR_A2_LSB_LSB_CLR_MASK 0xFFF0
#define SGTL5000_DAP_COEF_WR_A2_LSB_LSB_SHIFT    0x0

/*! @brief SGTL5000 I2C address. */
#define SGTL5000_I2C_ADDR 0x0A

/*! @brief sgtl handle size */
#ifndef SGTL_I2C_HANDLER_SIZE
#define SGTL_I2C_HANDLER_SIZE CODEC_I2C_MASTER_HANDLER_SIZE
#endif

/*! @brief sgtl i2c baudrate */
#define SGTL_I2C_BITRATE 100000U

/*! @brief Modules in Sgtl5000 board. */
typedef enum _sgtl5000_module
{
    kSGTL_ModuleADC = 0x0, /*!< ADC module in SGTL5000 */
    kSGTL_ModuleDAC,       /*!< DAC module in SGTL5000 */
    kSGTL_ModuleDAP,       /*!< DAP module in SGTL5000 */
    kSGTL_ModuleHP,        /*!< Headphone module in SGTL5000 */
    kSGTL_ModuleI2SIN,     /*!< I2S-IN module in SGTL5000 */
    kSGTL_ModuleI2SOUT,    /*!< I2S-OUT module in SGTL5000 */
    kSGTL_ModuleLineIn,    /*!< Line-in moudle in SGTL5000 */
    kSGTL_ModuleLineOut,   /*!< Line-out module in SGTL5000 */
    kSGTL_ModuleMicin      /*!< Micphone module in SGTL5000 */
} sgtl_module_t;

/*!
 * @brief Sgtl5000 data route.
 * @note Only provide some typical data route, not all route listed.
 * Users cannot combine any routes, once a new route is set, the precios one would be replaced.
 */
typedef enum _sgtl_route
{
    kSGTL_RouteBypass = 0x0,             /*!< LINEIN->Headphone. */
    kSGTL_RoutePlayback,                 /*!< I2SIN->DAC->Headphone. */
    kSGTL_RoutePlaybackandRecord,        /*!< I2SIN->DAC->Headphone, LINEIN->ADC->I2SOUT. */
    kSGTL_RoutePlaybackwithDAP,          /*!< I2SIN->DAP->DAC->Headphone. */
    kSGTL_RoutePlaybackwithDAPandRecord, /*!< I2SIN->DAP->DAC->HP, LINEIN->ADC->I2SOUT. */
    kSGTL_RouteRecord                    /*!< LINEIN->ADC->I2SOUT. */
} sgtl_route_t;

/*!
 * @brief The audio data transfer protocol choice.
 * Sgtl5000 only supports I2S format and PCM format.
 */
typedef enum _sgtl_protocol
{
    kSGTL_BusI2S = 0x0,      /*!< I2S Type */
    kSGTL_BusLeftJustified,  /*!< Left justified */
    kSGTL_BusRightJustified, /*!< Right Justified */
    kSGTL_BusPCMA,           /*!< PCMA */
    kSGTL_BusPCMB            /*!< PCMB */
} sgtl_protocol_t;

/*! @brief sgtl play channel  */
enum _sgtl_play_channel
{
    kSGTL_HeadphoneLeft  = 0, /*!< headphone left channel */
    kSGTL_HeadphoneRight = 1, /*!< headphone right channel */
    kSGTL_LineoutLeft    = 2, /*!< lineout left channel */
    kSGTL_LineoutRight   = 3, /*!< lineout right channel */
};

/*! @brief sgtl record source */
enum _sgtl_record_source
{
    kSGTL_RecordSourceLineIn = 0U, /*!< record source line in */
    kSGTL_RecordSourceMic    = 1U, /*!< record source single end */
};

/*! @brief sgtl play source */
enum _stgl_play_source
{
    kSGTL_PlaySourceLineIn = 0U, /*!< play source line in */
    kSGTL_PlaySourceDAC    = 1U, /*!< play source line in */
};

/*! @brief SGTL SCLK valid edge */
typedef enum _sgtl_sclk_edge
{
    kSGTL_SclkValidEdgeRising   = 0U, /*!< SCLK valid edge */
    kSGTL_SclkValidEdgeFailling = 1U, /*!< SCLK failling edge */
} sgtl_sclk_edge_t;

/*! @brief Audio format configuration. */
typedef struct _sgtl_audio_format
{
    uint32_t mclk_HZ;          /*!< master clock */
    uint32_t sampleRate;       /*!< Sample rate */
    uint32_t bitWidth;         /*!< Bit width */
    sgtl_sclk_edge_t sclkEdge; /*!< sclk valid edge */
} sgtl_audio_format_t;

/*! @brief Initailize structure of sgtl5000 */
typedef struct _sgtl_config
{
    sgtl_route_t route;         /*!< Audio data route.*/
    sgtl_protocol_t bus;        /*!< Audio transfer protocol */
    bool master_slave;          /*!< Master or slave. True means master, false means slave. */
    sgtl_audio_format_t format; /*!< audio format */

    uint8_t slaveAddress;         /*!< code device slave address */
    codec_i2c_config_t i2cConfig; /*!< i2c bus configuration */
} sgtl_config_t;

/*! @brief SGTL codec handler
 */
typedef struct _sgtl_handle
{
    sgtl_config_t *config;                    /*!< sgtl config pointer */
    uint8_t i2cHandle[SGTL_I2C_HANDLER_SIZE]; /*!< i2c handle */
} sgtl_handle_t;

